{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,66],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,141],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,158],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,118],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,124],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,135],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,119],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"dense_Dense40","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense40","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dense_Dense41","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense41","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"dense_Dense42","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense42","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"dense_Dense43","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense43","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"dense_Dense44","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense44","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"dense_Dense45","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense45","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"dense_Dense46","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense46","trainable":true},"inbound_nodes":[[["input7",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense40",0,0,{}],["dense_Dense41",0,0,{}],["dense_Dense42",0,0,{}],["dense_Dense43",0,0,{}],["dense_Dense44",0,0,{}],["dense_Dense45",0,0,{}],["dense_Dense46",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0],["input4",0,0],["input5",0,0],["input6",0,0],["input7",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.10.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense40/kernel","shape":[66,1000],"dtype":"float32"},{"name":"dense_Dense40/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense41/kernel","shape":[141,1000],"dtype":"float32"},{"name":"dense_Dense41/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense42/kernel","shape":[158,1000],"dtype":"float32"},{"name":"dense_Dense42/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense43/kernel","shape":[118,1000],"dtype":"float32"},{"name":"dense_Dense43/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense44/kernel","shape":[124,1000],"dtype":"float32"},{"name":"dense_Dense44/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense45/kernel","shape":[135,1000],"dtype":"float32"},{"name":"dense_Dense45/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense46/kernel","shape":[119,1000],"dtype":"float32"},{"name":"dense_Dense46/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}