{"modelTopology":{"class_name":"Model","config":{"name":"model8","layers":[{"name":"input43","class_name":"InputLayer","config":{"batch_input_shape":[null,113],"dtype":"float32","sparse":false,"name":"input43"},"inbound_nodes":[]},{"name":"input44","class_name":"InputLayer","config":{"batch_input_shape":[null,99],"dtype":"float32","sparse":false,"name":"input44"},"inbound_nodes":[]},{"name":"input45","class_name":"InputLayer","config":{"batch_input_shape":[null,101],"dtype":"float32","sparse":false,"name":"input45"},"inbound_nodes":[]},{"name":"input46","class_name":"InputLayer","config":{"batch_input_shape":[null,85],"dtype":"float32","sparse":false,"name":"input46"},"inbound_nodes":[]},{"name":"input47","class_name":"InputLayer","config":{"batch_input_shape":[null,78],"dtype":"float32","sparse":false,"name":"input47"},"inbound_nodes":[]},{"name":"input48","class_name":"InputLayer","config":{"batch_input_shape":[null,82],"dtype":"float32","sparse":false,"name":"input48"},"inbound_nodes":[]},{"name":"input49","class_name":"InputLayer","config":{"batch_input_shape":[null,65],"dtype":"float32","sparse":false,"name":"input49"},"inbound_nodes":[]},{"name":"dense_Dense43","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense43","trainable":true},"inbound_nodes":[[["input43",0,0,{}]]]},{"name":"dense_Dense44","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense44","trainable":true},"inbound_nodes":[[["input44",0,0,{}]]]},{"name":"dense_Dense45","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense45","trainable":true},"inbound_nodes":[[["input45",0,0,{}]]]},{"name":"dense_Dense46","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense46","trainable":true},"inbound_nodes":[[["input46",0,0,{}]]]},{"name":"dense_Dense47","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense47","trainable":true},"inbound_nodes":[[["input47",0,0,{}]]]},{"name":"dense_Dense48","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense48","trainable":true},"inbound_nodes":[[["input48",0,0,{}]]]},{"name":"dense_Dense49","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense49","trainable":true},"inbound_nodes":[[["input49",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense43",0,0,{}],["dense_Dense44",0,0,{}],["dense_Dense45",0,0,{}],["dense_Dense46",0,0,{}],["dense_Dense47",0,0,{}],["dense_Dense48",0,0,{}],["dense_Dense49",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input43",0,0],["input44",0,0],["input45",0,0],["input46",0,0],["input47",0,0],["input48",0,0],["input49",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.10.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense43/kernel","shape":[113,1000],"dtype":"float32"},{"name":"dense_Dense43/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense44/kernel","shape":[99,1000],"dtype":"float32"},{"name":"dense_Dense44/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense45/kernel","shape":[101,1000],"dtype":"float32"},{"name":"dense_Dense45/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense46/kernel","shape":[85,1000],"dtype":"float32"},{"name":"dense_Dense46/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense47/kernel","shape":[78,1000],"dtype":"float32"},{"name":"dense_Dense47/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense48/kernel","shape":[82,1000],"dtype":"float32"},{"name":"dense_Dense48/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense49/kernel","shape":[65,1000],"dtype":"float32"},{"name":"dense_Dense49/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}