{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input29","class_name":"InputLayer","config":{"batch_input_shape":[null,59],"dtype":"float32","sparse":false,"name":"input29"},"inbound_nodes":[]},{"name":"input30","class_name":"InputLayer","config":{"batch_input_shape":[null,79],"dtype":"float32","sparse":false,"name":"input30"},"inbound_nodes":[]},{"name":"input31","class_name":"InputLayer","config":{"batch_input_shape":[null,78],"dtype":"float32","sparse":false,"name":"input31"},"inbound_nodes":[]},{"name":"input32","class_name":"InputLayer","config":{"batch_input_shape":[null,61],"dtype":"float32","sparse":false,"name":"input32"},"inbound_nodes":[]},{"name":"input33","class_name":"InputLayer","config":{"batch_input_shape":[null,55],"dtype":"float32","sparse":false,"name":"input33"},"inbound_nodes":[]},{"name":"input34","class_name":"InputLayer","config":{"batch_input_shape":[null,61],"dtype":"float32","sparse":false,"name":"input34"},"inbound_nodes":[]},{"name":"input35","class_name":"InputLayer","config":{"batch_input_shape":[null,60],"dtype":"float32","sparse":false,"name":"input35"},"inbound_nodes":[]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["input29",0,0,{}]]]},{"name":"dense_Dense30","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true},"inbound_nodes":[[["input30",0,0,{}]]]},{"name":"dense_Dense31","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense31","trainable":true},"inbound_nodes":[[["input31",0,0,{}]]]},{"name":"dense_Dense32","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense32","trainable":true},"inbound_nodes":[[["input32",0,0,{}]]]},{"name":"dense_Dense33","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true},"inbound_nodes":[[["input33",0,0,{}]]]},{"name":"dense_Dense34","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true},"inbound_nodes":[[["input34",0,0,{}]]]},{"name":"dense_Dense35","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true},"inbound_nodes":[[["input35",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense29",0,0,{}],["dense_Dense30",0,0,{}],["dense_Dense31",0,0,{}],["dense_Dense32",0,0,{}],["dense_Dense33",0,0,{}],["dense_Dense34",0,0,{}],["dense_Dense35",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input29",0,0],["input30",0,0],["input31",0,0],["input32",0,0],["input33",0,0],["input34",0,0],["input35",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.10.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense29/kernel","shape":[59,1000],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense30/kernel","shape":[79,1000],"dtype":"float32"},{"name":"dense_Dense30/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense31/kernel","shape":[78,1000],"dtype":"float32"},{"name":"dense_Dense31/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense32/kernel","shape":[61,1000],"dtype":"float32"},{"name":"dense_Dense32/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense33/kernel","shape":[55,1000],"dtype":"float32"},{"name":"dense_Dense33/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense34/kernel","shape":[61,1000],"dtype":"float32"},{"name":"dense_Dense34/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense35/kernel","shape":[60,1000],"dtype":"float32"},{"name":"dense_Dense35/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}