{"modelTopology":{"class_name":"Model","config":{"name":"model9","layers":[{"name":"input40","class_name":"InputLayer","config":{"batch_input_shape":[null,59],"dtype":"float32","sparse":false,"name":"input40"},"inbound_nodes":[]},{"name":"input41","class_name":"InputLayer","config":{"batch_input_shape":[null,61],"dtype":"float32","sparse":false,"name":"input41"},"inbound_nodes":[]},{"name":"input42","class_name":"InputLayer","config":{"batch_input_shape":[null,69],"dtype":"float32","sparse":false,"name":"input42"},"inbound_nodes":[]},{"name":"input43","class_name":"InputLayer","config":{"batch_input_shape":[null,47],"dtype":"float32","sparse":false,"name":"input43"},"inbound_nodes":[]},{"name":"input44","class_name":"InputLayer","config":{"batch_input_shape":[null,52],"dtype":"float32","sparse":false,"name":"input44"},"inbound_nodes":[]},{"name":"input45","class_name":"InputLayer","config":{"batch_input_shape":[null,69],"dtype":"float32","sparse":false,"name":"input45"},"inbound_nodes":[]},{"name":"input46","class_name":"InputLayer","config":{"batch_input_shape":[null,60],"dtype":"float32","sparse":false,"name":"input46"},"inbound_nodes":[]},{"name":"dense_Dense40","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense40","trainable":true},"inbound_nodes":[[["input40",0,0,{}]]]},{"name":"dense_Dense41","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense41","trainable":true},"inbound_nodes":[[["input41",0,0,{}]]]},{"name":"dense_Dense42","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense42","trainable":true},"inbound_nodes":[[["input42",0,0,{}]]]},{"name":"dense_Dense43","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense43","trainable":true},"inbound_nodes":[[["input43",0,0,{}]]]},{"name":"dense_Dense44","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense44","trainable":true},"inbound_nodes":[[["input44",0,0,{}]]]},{"name":"dense_Dense45","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense45","trainable":true},"inbound_nodes":[[["input45",0,0,{}]]]},{"name":"dense_Dense46","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense46","trainable":true},"inbound_nodes":[[["input46",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense40",0,0,{}],["dense_Dense41",0,0,{}],["dense_Dense42",0,0,{}],["dense_Dense43",0,0,{}],["dense_Dense44",0,0,{}],["dense_Dense45",0,0,{}],["dense_Dense46",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input40",0,0],["input41",0,0],["input42",0,0],["input43",0,0],["input44",0,0],["input45",0,0],["input46",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.10.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense40/kernel","shape":[59,1000],"dtype":"float32"},{"name":"dense_Dense40/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense41/kernel","shape":[61,1000],"dtype":"float32"},{"name":"dense_Dense41/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense42/kernel","shape":[69,1000],"dtype":"float32"},{"name":"dense_Dense42/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense43/kernel","shape":[47,1000],"dtype":"float32"},{"name":"dense_Dense43/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense44/kernel","shape":[52,1000],"dtype":"float32"},{"name":"dense_Dense44/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense45/kernel","shape":[69,1000],"dtype":"float32"},{"name":"dense_Dense45/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense46/kernel","shape":[60,1000],"dtype":"float32"},{"name":"dense_Dense46/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}