{"modelTopology":{"class_name":"Model","config":{"name":"model5","layers":[{"name":"input21","class_name":"InputLayer","config":{"batch_input_shape":[null,267],"dtype":"float32","sparse":false,"name":"input21"},"inbound_nodes":[]},{"name":"input22","class_name":"InputLayer","config":{"batch_input_shape":[null,272],"dtype":"float32","sparse":false,"name":"input22"},"inbound_nodes":[]},{"name":"input23","class_name":"InputLayer","config":{"batch_input_shape":[null,293],"dtype":"float32","sparse":false,"name":"input23"},"inbound_nodes":[]},{"name":"input24","class_name":"InputLayer","config":{"batch_input_shape":[null,186],"dtype":"float32","sparse":false,"name":"input24"},"inbound_nodes":[]},{"name":"input25","class_name":"InputLayer","config":{"batch_input_shape":[null,288],"dtype":"float32","sparse":false,"name":"input25"},"inbound_nodes":[]},{"name":"input26","class_name":"InputLayer","config":{"batch_input_shape":[null,267],"dtype":"float32","sparse":false,"name":"input26"},"inbound_nodes":[]},{"name":"input27","class_name":"InputLayer","config":{"batch_input_shape":[null,107],"dtype":"float32","sparse":false,"name":"input27"},"inbound_nodes":[]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["input21",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["input22",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["input23",0,0,{}]]]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["input24",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["input25",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["input26",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["input27",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}],["dense_Dense27",0,0,{}],["dense_Dense28",0,0,{}],["dense_Dense29",0,0,{}],["dense_Dense6",0,0,{}],["dense_Dense2",0,0,{}],["dense_Dense3",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input21",0,0],["input22",0,0],["input23",0,0],["input24",0,0],["input25",0,0],["input26",0,0],["input27",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense26/kernel","shape":[267,1000],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[272,1000],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[293,1000],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[186,1000],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[288,1000],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[267,1000],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[107,1000],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}