{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,137],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"input9","class_name":"InputLayer","config":{"batch_input_shape":[null,179],"dtype":"float32","sparse":false,"name":"input9"},"inbound_nodes":[]},{"name":"input10","class_name":"InputLayer","config":{"batch_input_shape":[null,165],"dtype":"float32","sparse":false,"name":"input10"},"inbound_nodes":[]},{"name":"input11","class_name":"InputLayer","config":{"batch_input_shape":[null,99],"dtype":"float32","sparse":false,"name":"input11"},"inbound_nodes":[]},{"name":"input12","class_name":"InputLayer","config":{"batch_input_shape":[null,96],"dtype":"float32","sparse":false,"name":"input12"},"inbound_nodes":[]},{"name":"input13","class_name":"InputLayer","config":{"batch_input_shape":[null,114],"dtype":"float32","sparse":false,"name":"input13"},"inbound_nodes":[]},{"name":"input14","class_name":"InputLayer","config":{"batch_input_shape":[null,127],"dtype":"float32","sparse":false,"name":"input14"},"inbound_nodes":[]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["input9",0,0,{}]]]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input10",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["input11",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["input12",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input13",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["input14",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}],["dense_Dense9",0,0,{}],["dense_Dense10",0,0,{}],["dense_Dense11",0,0,{}],["dense_Dense12",0,0,{}],["dense_Dense13",0,0,{}],["dense_Dense2",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input8",0,0],["input9",0,0],["input10",0,0],["input11",0,0],["input12",0,0],["input13",0,0],["input14",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense8/kernel","shape":[137,1000],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[179,1000],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[165,1000],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[99,1000],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[96,1000],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[114,1000],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[127,1000],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}