{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input12","class_name":"InputLayer","config":{"batch_input_shape":[null,125],"dtype":"float32","sparse":false,"name":"input12"},"inbound_nodes":[]},{"name":"input13","class_name":"InputLayer","config":{"batch_input_shape":[null,153],"dtype":"float32","sparse":false,"name":"input13"},"inbound_nodes":[]},{"name":"input14","class_name":"InputLayer","config":{"batch_input_shape":[null,150],"dtype":"float32","sparse":false,"name":"input14"},"inbound_nodes":[]},{"name":"input15","class_name":"InputLayer","config":{"batch_input_shape":[null,102],"dtype":"float32","sparse":false,"name":"input15"},"inbound_nodes":[]},{"name":"input16","class_name":"InputLayer","config":{"batch_input_shape":[null,104],"dtype":"float32","sparse":false,"name":"input16"},"inbound_nodes":[]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["input12",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input13",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["input14",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["input15",0,0,{}]]]},{"name":"dense_Dense16","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true},"inbound_nodes":[[["input16",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense12",0,0,{}],["dense_Dense13",0,0,{}],["dense_Dense14",0,0,{}],["dense_Dense15",0,0,{}],["dense_Dense16",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input12",0,0],["input13",0,0],["input14",0,0],["input15",0,0],["input16",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense12/kernel","shape":[125,1000],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[153,1000],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[150,1000],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[102,1000],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[104,1000],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[5000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}